motion_concepts = {
    "average_acceleration": "شتاب متوسط برابر است با تغییرات سرعت تقسیم بر زمان. این مقدار نشان‌دهنده نرخ تغییر سرعت در طول زمان است: a = (v - v₀) / t",

    "average_speed": "سرعت متوسط برابر است با مسافت کل طی‌شده تقسیم بر زمان کل. این مقدار یک کمیت اسکالر است و جهت حرکت را در نظر نمی‌گیرد: s = l / t",

    "average_velocity": "سرعت متوسط برابر است با جابجایی کل تقسیم بر زمان کل. این مقدار یک کمیت برداری است و جهت حرکت را در نظر می‌گیرد: v = x / t",

    "final_velocity": "سرعت نهایی مقدار سرعت جسم در پایان یک بازه زمانی است. این مقدار را می‌توان با استفاده از معادلات سینماتیکی محاسبه کرد، مانند: v = v₀ + at",

    "base_velocity": "سرعت اولیه (v₀) مقدار سرعت جسم در آغاز یک بازه زمانی است، قبل از اعمال هرگونه شتاب.",

    "time": "زمان (t) مدت‌زمانی است که در آن حرکت یا تغییر رخ می‌دهد. این مقدار یک کمیت اسکالر است و واحد آن ثانیه (s) می‌باشد.",

    "displacement_l": "جابجایی (l) به معنای فاصله طی‌شده در یک جهت خاص است. این مقدار یک کمیت برداری است و با مسیر طی‌شده تفاوت دارد.",

    "displacement_x": "جابجایی در خط مستقیم (x) برابر است با تغییر مکان جسم در امتداد یک محور. این مقدار از تفریق مکان اولیه از مکان نهایی به‌دست می‌آید.",

    "equation_x_v_v0": "این معادله برای محاسبه جابجایی زمانی که سرعت متوسط و زمان مشخص هستند استفاده می‌شود: x = ((v + v₀) / 2) * t",

    "equation_v2_v02": "این معادله رابطه‌ای بین سرعت نهایی، سرعت اولیه، شتاب و جابجایی برقرار می‌کند و زمانی که زمان مشخص نیست کاربرد دارد: v² - v₀² = 2ax",

    "equation_x_at2_v0t": "این معادله برای محاسبه جابجایی زمانی که سرعت اولیه، شتاب و زمان مشخص هستند استفاده می‌شود: x = ½at² + v₀t",

    "equation_a_v_v0_t": "این معادله شتاب متوسط را به‌صورت تغییرات سرعت تقسیم بر زمان تعریف می‌کند: a = (v - v₀) / t",

    "equation_s_l_t": "این فرمول برای محاسبه سرعت متوسط است، که برابر است با مسافت کل تقسیم بر زمان: s = l / t",

    "equation_v_x_t": "این فرمول برای محاسبه سرعت متوسط برداری است، که برابر است با جابجایی تقسیم بر زمان: v = x / t"}


